reports/verification/load_test.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        BaseHTTP/0.6
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        253 bytes

Concurrency Level:      120
Time taken for tests:   0.084 seconds
Complete requests:      1000
Failed requests:        966
   (Connect: 0, Receive: 0, Length: 966, Exceptions: 0)
Non-2xx responses:      966
Total transferred:      217358 bytes
Total body sent:        343000
HTML transferred:       53038 bytes
Requests per second:    11943.72 [#/sec] (mean)
Time per request:       10.047 [ms] (mean)
Time per request:       0.084 [ms] (mean, across all concurrent requests)
Transfer rate:          2535.22 [Kbytes/sec] received
                        4000.68 kb/s sent
                        6535.90 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   1.4      3       8
Processing:     1    4   2.0      3      26
Waiting:        0    2   1.9      2      21
Total:          4    7   2.6      6      30

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      6
  75%      7
  80%      7
  90%     10
  95%     11
  98%     16
  99%     18
 100%     30 (longest request)